Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: This inserts the current time and date in UTC format at the top of the file.
es_es: Esto inserta la hora y fecha actuales en formato UTC en la primera línea del archivo.

source: (Well, if you have a date command that accepts the "-u" argument.) Note the difference with using "!!date": that replaced a line, while ":read !date" will insert a line.
es_es: (Bueno, si tienes una orden «date» que acepta el argumento «-u».) Tenga en cuenta la diferencia de usar «!!date»; esto reemplazó una línea, mientras que «:read !date» insertó una línea.

source: The Unix command "wc" counts words.
es_es: La orden Unix «wc» cuenta palabras.

source: To count the words in the current file: >
es_es: Para contar las del archivo actual: >

source: This is the same write command as before, but instead of a file name the "!" character is used and the name of an external command.
es_es: Esta es la misma orden «write» vista que anteriormente, pero en lugar de un nombre de archivo, se emplean el carácter «!» y una orden externa.

source: The written text will be passed to the specified command as its standard input.
es_es: El texto guardado será pasado al orden especificado como entrada estándar.

source: The "wc" command isn't verbose.
es_es: La orden «wc» no es muy informativa.

source: This means you have 4 lines, 47 words and 249 characters.
es_es: Esto significa que tiene 4 líneas, 47 palabras y 249 caracteres.

source: This will write the file "wc" in the current directory, with force.
es_es: Esto guardará el archivo «wc» en el directorio actual con la opción «force» (forzar).

source: White space is important here!
es_es: ¡El espacio en blanco es muy importante en este caso!

source: If the external command produced an error message, the display may have been messed up.
es_es: Si la orden externa produjo un mensaje de error, la pantalla de Vim tal vez esté sobreescrita con información confusa.

source: Vim is very efficient and only redraws those parts of the screen that it knows need redrawing.
es_es: Vim es muy eficiente y sólo reescribe aquellas partes de la pantalla que lo necesiten.

source: But it can't know about what another program has written.
es_es: Pero no puede saber sobre lo que otro programa ha tocado.

source: To tell Vim to redraw the screen: >
es_es: Para decirle a Vim que redibuje la pantalla: >

source: *usr_20.txt* For Vim version 7.3.
es_es: *usr_20.esx* Para Vim versión 7.3.

source: Vim has a few generic features that makes it easier to enter commands.
es_es: Vim posee algunas características genéricas que le facilitan introducir órdenes.

source: Colon commands can be abbreviated, edited and repeated.
es_es: Las órdenes de colon («:») se pueden abreviar, editar y repetir.

source: Completion is available for nearly everything.
es_es: Dispone de auto compleción para prácticamente todo.

source: When you use a colon (:) command or search for a string with / or ?, Vim puts the cursor on the bottom of the screen.
es_es: Cuando usa una orden de colon («:») o busca una cadena con «/» o «?», Vim sitúa el cursor en la parte inferior de la pantalla.

source: There you type the command or search pattern.
es_es: Ahí es donde introduce la orden o el patrón de búsqueda.

source: This is called the Command line.
es_es: A esto se le llama la línea de órdenes.

source: Also when it's used for entering a search command.
es_es: También cuando se usa para introducir una orden de búsqueda.

source: The most obvious way to edit the command you type is by pressing the <BS> key.
es_es: La manera más obvia de editar la orden introducida es pulsando la tecla <BS>.

source: This erases the character before the cursor.
es_es: Esto elimina el carácter anterior al cursor.

source: To erase another character, typed earlier, first move the cursor with the cursor keys.
es_es: Para eliminar otro carácter introducido previamente, desplace antes el cursor con las teclas del cursos.

source: For example, you have typed this: >
es_es: Por ejemplo, suponga que ha tecleado esto: >

source: Before you hit <Enter>, you notice that "col" should be "cow".
es_es: Antes de pulsar <Intro>, notará que «vaba» debería ser «vaca».

source: To correct this, you type <Left> five times.
es_es: Para corregir esto, pulse <Izquierda> seis veces.

source: The cursor is now just after "col".
es_es: El cursor está ahora sobre «vaba».

source: Type <BS> and "w" to correct: >
es_es: Teclee <BS> y «w» para corregirlo: >

source: Now you can press <Enter> directly.
es_es: Ya puede pulsar <Intro> directamente.

source: You don't have to move the cursor to the end of the line before executing the command.
es_es: No tiene que desplazar el cursor al final de la línea antes de ejecutar la orden.

source: Note: <S-Left> (cursor left key with Shift key pressed) and <C-Left> (cursor left key with Control pressed) will not work on all keyboards.
es_es: Nota: <S-Izq.> (tecla izquierda del cursor con la tecla Shift pulsada) y <C-Izq.> (tecla izquierda del cursor con la tecla Control pulsada) no funciona en todos los teclados.

source: Same for the other Shift and Control combinations.
es_es: Ocurre lo mismo con las otras combinaciones con Shift y Control.

source: As mentioned, <BS> deletes the character before the cursor.
es_es: Como ya se ha dicho, <BS> elimina el carácter anterior al cursor.

source: To delete a whole word use CTRL-W.
es_es: Para eliminar toda una palabra, use CTRL-W.

source: The <Insert> key toggles between inserting characters and replacing the existing ones.
es_es: La tecla <Insertar> conmuta entra insertar caracteres y reemplaza los existentes.

source: Start with this text:
es_es: Comience con este texto.

source: Move the cursor to the start of "fine" with <S-Left> twice (or <Left> eight times, if <S-Left> doesn't work).
es_es: Desplace el cursor al inicio de «sutil» con <S-Izq.> dos veces (o <Izq.> ocho veces, si <S-Izq.> no funciona.

source: Now press <Insert> to switch to overstrike and type "great":
es_es: Pulse ahora <Insertar> para pasar a superposición y teclee «gran»:

source: Oops, we lost the space.
es_es: Vaya, hemos perdido un espacio.

source: Now, don't use <BS>, because it would delete the "t" (this is different from Replace mode).
es_es: Ahora, no use <BS> porque eliminaría la «t» (a diferencia del modo Reemplazar).

source: Instead, press <Insert> to switch from overstrike to inserting, and type the space:
es_es: En lugar de ello, pulse <Insertar> para pasar de superposición a insertar, e introduzca el espacio:

source: You thought of executing a : or / command, but changed your mind.
es_es: Se le ocurrió ejecutar una orden «:» o «/», pero cambió de opinión.

source: To get rid of what you already typed, without executing it, press CTRL-C or <Esc>.
es_es: Para desechar de lo que ya tecleó sin ejecutarlo pulse CTRL-C o <Esc>.

source: Note: <Esc> is the universal "get out" key.
es_es: Nota: <Esc> es la tecla universal de salir.

source: Unfortunately, in the good old Vi pressing <Esc> in a command line executed the command!
es_es: Desafortunadamente, en el bueno y viejo Vi, pulsar <Esc> la línea de órdenes ejecutaba la orden.

source: Since that might be considered to be a bug, Vim uses <Esc> to cancel the command.
es_es: Ya que esto se puede considerar un fallo, Vim usa <Esc> para cancelar la orden.

source: But with the 'cpoptions' option it can be made Vi compatible.
es_es: Pero puede hacer que sea compatible con Vi con la opción 'cpoptions'.

source: And when using a mapping (which might be written for Vi) <Esc> also works Vi compatible.
es_es: Y cuando usa una macro (quizá escrito para Vi) <Esc> también funciona de manera compatible con Vi.

source: Therefore, using CTRL-C is a method that always works.
es_es: Por ello, siempre funcionará el metodo CTRL-C.

source: If you are at the start of the command line, pressing <BS> will cancel the command.
es_es: Si se halla al inicio de la línea de órdenes, pulsar <BS> cancelaría la orden.

source: It's like deleting the ":" or "/" that the line starts with.
es_es: Es como eliminar el «:» o «/» al inicio de la línea.

source: Some of the ":" commands are really long.
es_es: Algunas de las órdenes «:» son muy largas.

source: We already mentioned that ":substitute" can be abbreviated to ":s".
es_es: Ya hemos mencionado que «:substitute» se puede abreviar con «:s».

source: This is a generic mechanism, all ":" commands can be abbreviated.
es_es: Este es un mecanismo genérico, todas las órdenes «:» se pueden abreviar.

source: How short can a command get?
es_es: ¿Como de corto puede ser una orden?

source: There are 26 letters, and many more commands.
es_es: Hay unas 30 letras, y muchas más órdenes.

source: For example, ":set" also starts with ":s", but ":s" doesn't start a ":set" command.
es_es: Por ejemplo, «:set» también empieza con «:s», pero «:s» no inicia la orden «:set».

source: Instead ":set" can be abbreviated to ":se".
es_es: En lugar de ello, puede abreviar «:set» con «:se».

source: When the shorter form of a command could be used for two commands, it stands for only one of them.
es_es: Cuando se podría usar la forma corta de una orden para dos órdenes, sólo simboliza uno de ellos.

source: There is no logic behind which one, you have to learn them.
es_es: No hay una lógica detrás de cada elección, tendrá que aprenderlos.

source: In the help files the shortest form that works is mentioned.
es_es: En los archivos de ayuda se menciona la forma más corta que funciona.

source: For example: >
es_es: Por ejemplo: >

source: This means that the shortest form of ":substitute" is ":s".
es_es: Esto significa que la forma corta de «:substitute» es «:s».

source: The following characters are optional.
es_es: Los siguientes caracteres son opcionales.

source: Thus ":su" and ":sub" also work.
es_es: Por ello, también funcionan «:su» y «:sub».

source: In the user manual we will either use the full name of command, or a short version that is still readable.
es_es: En el manual de usuario usaremos o bien el nombre completo de la orden, o una versión corta pero legible.

source: For example, ":function" can be abbreviated to ":fu".
es_es: Por ejemplo, se puede acortar «:function» a «:fu».

source: But since most people don't understand what that stands for, we will use ":fun".
es_es: Pero debido a que la mayoría de la gente no entiende qué simboliza, nosotros usaremos «:fun».

source: (Vim doesn't have a ":funny" command, otherwise ":fun" would be confusing too.)
es_es: (Vim no tiene una orden llamada «:funny», en caso contrario, esto también sería confuso.)

source: It is recommended that in Vim scripts you write the full command name.
es_es: Recomendamos que escriba la orden completa en los Vim scripts.

source: That makes it easier to read back when you make later changes.
es_es: Esto hace más fácil leerlo cuando introduce cambios más tarde.

source: Except for some often used commands like ":w" (":write") and ":r" (":read").
es_es: A excepción de órdenes usadas con frecuencia como «:w» («:write») y «:r» («:read»).

source: A particularly confusing one is ":end", which could stand for ":endif", ":endwhile" or ":endfunction".
es_es: Un caso particularmente confuso es «:end», que podría simbolizar «:endif», «:endwhile» o «:endfunction».

source: Therefore, always use the full name.
es_es: Por ello, use siempre el nombre completo.

source: In the user manual the long version of the option names is used.
es_es: En el manual de usuario se usa la versión larga de los nombres de opción.

source: Many options also have a short name.
es_es: Varias opciones tienen también un nombre corto.

source: Unlike ":" commands, there is only one short name that works.
es_es: A diferencia de las órdenes «:», sólo hay un nombre corto que funcione.

source: For example, the short name of 'autoindent' is 'ai'.
es_es: Por ejemplo, el nombre corto de 'autoindent' es 'ai'.

source: Thus these two commands do the same thing: >
es_es: Por ello, estas dos órdenes hacen lo mismo: >

source: This is one of those Vim features that, by itself, is a reason to switch from Vi to Vim.
es_es: Esta es una opción que en si misma hace que merezca la pena pasar de Vi a Vim.

source: Once you have used this, you can't do without.
es_es: Una vez que haya usado esto, no podrá vivir sin el.

source: It's easy to type this wrong.
es_es: Es fácil equivocarse al teclear esto.

source: A much quicker way is: >
es_es: Una manera más rápida es: >

source: Which will result in the same command.
es_es: Esto viene a ser la misma orden.

source: What happened?
es_es: ¿Qué ocurrió?

source: The <Tab> key does completion of the word before the cursor.
es_es: La tecla <Tab> realiza el autocompletado de la palabra anterior al cursor.

source: In this case "b".
es_es: «b» en este caso.

source: Vim looks in the directory and finds only one file that starts with a "b".
es_es: Vim busca en el directorio y encuentra sólo un archivo cuyo nombre empieza por «b».

source: That must be the one you are looking for, thus Vim completes the file name for you.
es_es: Este debe ser el que está buscando, y por ello Vim completa por usted el nombre del archivo.

source: The beep means that Vim has found more than one match.
es_es: El pitido significa que Vim encontró más de una coincidencia.

source: It then uses the first match it found (alphabetically).
es_es: Entonces usa la primera coincidencia encontrada (en orden alfabético).

source: If you press <Tab> again, you get: >
es_es: Si pulsa <Tab> otra vez, obtendrá: >

source: Thus, if the first <Tab> doesn't give you the file you were looking for, press it again.
es_es: Por ello, si el primer <Tab> no le da el archivo que está buscando, púlselo otra vez.

source: If there are more matches, you will see them all, one at a time.
es_es: Si hay más coincidencias, las verá todas de una en una.

source: If you press <Tab> on the last matching entry, you will go back to what you first typed: >
es_es: Si pulsa <Tab> otra vez en la última entrada coincidente, volverá a lo que tecleo en un principio: >

source: What happens here is that Vim inserts the old value of the option.
es_es: Lo que aquí ocurre es que Vim inserta el valor antiguo de la opción.

source: Now you can edit it.
es_es: Puede editarla ahora.

source: What is completed with <Tab> is what Vim expects in that place.
es_es: Lo que se completó con <Tab> es lo que Vim espera en primer lugar.

source: Just try it out to see how it works.
es_es: Pruebe esto ahora para ver su funcionamiento.

source: In some situations you will not get what you want.
es_es: En algunas situaciones no obtendrá lo que desea.

source: That's either because Vim doesn't know what you want, or because completion was not implemented for that situation.
es_es: Esto es debido a que Vim no sabe lo que quiere, o porque no se ha implementado el autocompletado para este evento.

source: In that case you will get a <Tab> inserted (displayed as ^I).
es_es: En ese caso, obtendrá un <Tab> insertado (se mostrará como ^I).

source: When there are many matches, you would like to see an overview.
es_es: Cuando haya coinicidencias, querrá una vista general.

source: Do this by pressing CTRL-D.
es_es: Obtenga esto pulsando CTRL-D.

source: For example, pressing CTRL-D after: >
es_es: Por ejemplo, si pulsa CTRL-D después de: >

source: The CTRL-L command completes the word to the longest unambiguous string.
es_es: La orden CTRL-L completa la palabra hasta llegar a la cadena no ambigua más larga.

source: If you type ":edit i" and there are files "info.txt" and "info_backup.txt" you will get ":edit info".
es_es: Si teclea «:edit i» y hay archivos «info.txt» e «info_backup.txt» obtendrá «:edit info».

source: In chapter 3 we briefly mentioned the history.
es_es: En el capítulo 3 mencionamos de manera breve el historial.

source: The basics are that you can use the <Up> key to recall an older command line.
es_es: Lo básico es que puede usar la tecla <Arriba> para invocar una orden ya pasada.

source: <Down> then takes you back to newer commands.
es_es: <Abajo> le lleva a aquellas órdenes más recientes.

source: There are actually four histories.
es_es: De hecho, hay cuatro historiales.

source: The ones we will mention here are for ":" commands and for "/" and "?" search commands.
es_es: Los que vamos a mencionar aquí son las órdenes «:» y las órdenes de búsqueda «/» y «?».

source: The "/" and "?" commands share the same history, because they are both search commands.
es_es: Las órdenes «/» y «?» comparten el mismo historial, ya que ambos son órdenes de búsqueda.

source: The two other histories are for expressions and input lines for the input() function.
es_es: Los otros dos historiales sirven para las expresiones y líneas de entrada de la función input().

source: Suppose you have done a ":set" command, typed ten more colon commands and then want to repeat that ":set" command again.
es_es: Suponga que ejecutó una orden «:set», introdujo diez órdenes «:» más y que después quiera repetir la orden «:set» otra vez.

source: You could press ":" and then ten times <Up>.
es_es: Puede pulsar «:» y diez veces <Arriba>.

source: There is a quicker way: >
es_es: Existe una manera más rápida.

source: Vim will now go back to the previous command that started with "se".
es_es: Vim volverá ahora a la orden anterior que empezase con «se».

source: You have a good chance that this is the ":set" command you were looking for.
es_es: Tendrá muchas posibilidades de que esta sea la oren «:set» que estaba buscando.

source: At least you should not have to press <Up> very often (unless ":set" commands is all you have done).
es_es: Por lo menos no tendrá que pulsar <Arriba> varias veces (a menos que las órdenes «:set» sea todo lo que ha hecho).

source: The <Up> key will use the text typed so far and compare it with the lines in the history.
es_es: La tecla <Arriba> usará el texto introducido hasta el momento y lo comparará con las líneas en el historial.

source: Only matching lines will be used.
es_es: Solo se usarán las líneas coincidentes.

source: If you do not find the line you were looking for, use <Down> to go back to what you typed and correct that.
es_es: En caso de no encontrar la línea que buscaba, use <Down> para volver a lo que tecleó y corrija eso.

source: Or use CTRL-U to start all over again.
es_es: O use CTRL-U para iniciar el proceso otra vez.

source: That's the history of ":" commands.
es_es: Este es el historial de las órdenes «:».

source: The search history is displayed with this command: >
es_es: Puede ver el historial de búsquedas con esta orden: >

source: Typing the text in the command line works different from typing text in Insert mode.
es_es: Teclear el texto en la línea de órdenes funciona de manera distinta a teclear texto en el modo Insertar.

source: It doesn't allow many commands to change the text.
es_es: No permite a varias órdenes modificar el texto.

source: For most commands that's OK, but sometimes you have to type a complicated command.
es_es: Esto está bien para varias órdenes, aunque a veces tiene que teclear una orden complicada.

source: That's where the command line window is useful.
es_es: En esta situación es cuando la ventana de línea de órdenes es útil.

source: Vim now opens a (small) window at the bottom.
es_es: Vim abrirá ahora una pequeña ventana en la base.

source: It contains the command line history, and an empty line at the end:
es_es: Contiene el historial de la línea de órdenes, y una línea vacía al final.

source: You are now in Normal mode.
es_es: Ahora se encuentra en el modo Normal.

source: You can use the "hjkl" keys to move around.
es_es: Puede usar las teclas «hjkl» para desplazarse.

source: For example, move up with "5k" to the ":e config.h.in" line.
es_es: Por ejemplo, desplácese con «5k» hasta la línea «:e config.h.in».

source: Type "$h" to go to the "i" of "in" and type "cwout".
es_es: Teclee «$h» para ir a la «i» de «in» y teclee «cwout».

source: Now you have changed the line to:
es_es: Ahora, ha cambiado la línea a:

source: The command line window is very useful when you want to have overview of the history, lookup a similar command, change it a bit and execute it.
es_es: La ventana de línea de órdenes es muy útil cuando quiere una vista general del historial, mirar una orden similar, modificarlo y ejecutarlo.

source: A search command can be used to find something.
es_es: Puede usar una orden de búsqueda para buscar algo.

source: In the previous example the "?config" search command could have been used to find the previous command that contains "config".
es_es: En el ejemplo anterior, la orden de búsqueda «?config» se podría haber usado para encontrar una orden anterior que contenga «?config».

source: It's a bit strange, because you are using a command line to search in the command line window.
es_es: Es un poco extraño, pues está usando una línea de órdenes para buscar en la ventana de línea de órdenes.

source: While typing that search command you can't open another command line window, there can be only one.
es_es: No podrá abrir otra ventana de línea de órdenes mientras teclee la orden de búsqueda, ya que sólo puede haber una.

source: *usr_08.txt* For Vim version 7.3.
es_es: *usr_08.esx* Para Vim versión 7.3.

source: Last change: 2006 Jul 18
es_es: Último cambio: 18/6/2006

source: Display two different files above each other.
es_es: Mostrar dos archivos diferentes uno encima del otro.

source: Or view two locations in the file at the same time.
es_es: Mirar dos puntos del mismo archivo a la vez.

source: See the difference between two files by putting them side by side.
es_es: Ver las diferencias entre un archivo y otro poniéndolos uno al lado del otro.

source: All this is possible with split windows.
es_es: Todo esto es posible dividiendo en ventanas.

source: The CTRL-W w command can be used to jump between the windows.
es_es: La orden CTRL-W w se puede usar para saltar de una ventana a otra.

source: If you are in the top window, CTRL-W w jumps to the window below it.
es_es: Si está en la ventana superior, CTRL-W w salta a la ventana inferior.

source: If you are in the bottom window it will jump to the first window.
es_es: Si está en la ventana inferior saltará a la primera ventana.

source: (CTRL-W CTRL-W does the same thing, in case you let go of the CTRL key a bit later.)
es_es: (CTRL-W CTRL-W hace lo mismo, en caso de que suelte la tecla CTRL un poco después.)

source: Actually, any command that quits editing a file works, like ":quit" and "ZZ".
es_es: De hecho, cualquier orden que salga del archivo funciona, como «:quit» y «ZZ».

source: But ":close" prevents you from accidentally exiting Vim when you close the last window.
es_es: Pero «:close» evitará que salga accidentalmente de Vim cuando cierre la última ventana.

source: This closes all windows, except for the current one.
es_es: Esto cierra todas las ventanas, excepto la actual.

source: If any of the other windows has changes, you will get an error message and that window won't be closed.
es_es: Si cualquiera de las otras ventanas tiene cambios, obtendrá un mensaje de error y esa ventana no se cerrará.

source: The ":split" command can take a number argument.
es_es: La orden «:split» puede recibir un argumento numérico.

source: If specified, this will be the height of the new window.
es_es: Si se especifica, este será la altura de la nueva ventana.

source: For example, the following opens a new window three lines high and starts editing the file alpha.c: >
es_es: Por ejemplo, el siguiente abre una nueva ventana con una altura de tres líneas y edita el archivo alpha.c: >

source: For existing windows you can change the size in several ways.
es_es: Para ventanas ya existentes puede cambiar el tamaño de varias formas.
